print('----------------------- 问题1 -----------------------')
# 问题1
# 编写一个程序，查找所有此类数字，它们可以被7整除，但不能是5的倍数（在2000和3200之间
# （均包括在内））。获得的数字应以逗号分隔的顺序打印在一行上。

# 3.创建空列表里，以便放置符合条件的数字
list1 = []

# 1.遍历从2000到3200
for i in range(2000,3201):
    # 2.判断是否能被7整除，且非5的倍数
    if i % 7 == 0 and i % 5 != 0:
        # 4. 把符合条件的放置进入列表里
        list1.append(str(i))
print(','.join(list1))

print('----------------------- 问题2 -----------------------')

# 问题2
# 编写一个程序，可以计算给定数字的阶乘，结果应以逗号分隔的顺序打印在一行上，假设向程序提
# 供了以下输入：8然后，输出应为：40320

# 1.把输入的值转换成整数，并且赋予变量n
# n = int(input('请输入任意整数：'))
n = 8
# 4.定义变量fact = 1,计算阶乘后的值
fact = 1

# 2.循环，从8到1
while n > 0:
    # 5.计算阶乘值
    fact *= n
    # 3.循环逐步递减
    n -= 1
print(f'输出值为：{fact}')

print('----------------------- 问题3 -----------------------')

# 问题3
# 使用给定的整数n，编写程序以生成包含（i，ixi）的字典，该字典为1到n之间的整数（都包括在
# 内）。然后程序应打印字典。假设向程序提供了以下输入：8\
# 然后，输出应为：
# {1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64}

# 1.把输入的值转换成整数，并且赋予变量n
# n = int(input('请输入任意整数：'))
n = 8
# 2.用推导式，从1开始遍历到n，获取对应key和value值
dict1 = {i:i*i for i in range(1, n+1)}
# 3.输出值
print(dict1)

print('----------------------- 问题4 -----------------------')
# 问题4
# 编写一个程序，该程序从控制台接受一个逗号分隔的数字序列，并生成一个列表和一个包含每个数
# 字的元组。假设向该程序提供了以下输入：
# 34,67,55,33,12,98
# 然后，输出应为：
# ['34', '67', '55', '33', '12', '98']
# ('34', '67', '55', '33', '12', '98')

# 解法一：按题目要求
# 1.设置输入值变量
# input1 = input('输入内容：')
input1 = '34,67,55,33,12,98'
# 2.把字符串按逗号分隔成子字符串列表
list1 = input1.split(',')
# 3.直接转换列表格式的数据成元组格式
tuple1 = tuple(list1)
# 4.输出
print(list1)
print(tuple1)

# 解法二： 当输出值为数字列表和数字元组时，需要转换数据类型
# 1.设置输入值变量
# input1 = input('输入内容：')
input1 = '34,67,55,33,12,98'
# 2.把字符串按逗号分隔成子字符串列表
splited = input1.split(',')
# # 3.创建空列表变量
# list1 = list()
# # 4.遍历获取分割后字符列表中的元素
# for str in splited:
#     # 5.把每个元素进行数据类型转化：str -> int
#     str = int(str)
#     # 6.把转换后的元素放入列表中
#     list1.append(str)
# 3-6 简化版本
list1 = [int(str) for str in splited]
# 7.直接转换列表格式的数据成元组格式
tuple1 = tuple(list1)
# 8.输出
print(list1)
print(tuple1)

print('----------------------- 问题5 -----------------------')

# 问题5 ***
# 定义一个至少具有两个方法的类：
# getString：从控制台输入获取字符串
# printString：以大写字母打印字符串
# 还请包括简单的测试功能来测试类方法。

class test_class:
    def getString(self):
        # self.str = input()
        self.str = 'abc'

    def printString(self):
        print(self.str.upper())


ts = test_class()
ts.getString()
ts.printString()

print('----------------------- 问题6 -----------------------')

# 问题6 ***
# 编写一个程序，根据给定的公式计算并打印该值：
# Q = [（2 _ C _ D）/ H]的平方根
# 以下是C和H的固定值：
# C为50。H为30。
# D是变量，其值应以逗号分隔的顺序输入到您的程序中，例如，让我们假设以下逗号分隔的输入顺
# 序被赋予了程序：
# 100,150,180
# 该程序的输出应为
# 18,22,24

# 调用包
from math import sqrt
# 1.根据题意，设置对应变量
C = 50
H = 30


# 2. 定义计算函数，计算 Q = [（2 _ C _ D）/ H]的平方根
def calc(d):
    return sqrt((2 * C * d) / H)


# 3.定义输入值变量
# D = input()
D = '100,150,180'
# 4.拆分字符串成列表
d = D.split(',')
# 5. 调用cal函数计算，把计算后的结果通过逗号连接起来
Q = ','.join([str(round(calc(int(i)))) for i in d])
# 6. 输出
print(Q)

print('----------------------- 问题7 -----------------------')

# 问题7
# _编写一个程序，该程序将X，Y两位数字作为输入并生成一个二维数组。数组的第i行和第j列中的
# 元素值应为i _ j。*
# 注意：i = 0,1 ..，X-1; j = 0,1，¡Y-1。假设将以下输入提供给程序：3,5
# 然后，程序的输出应为：
# [[0, 0, 0, 0, 0], [0, 1, 2, 3, 4], [0, 2, 4, 6, 8]]

# 1.设置输入值变量
# input1 = input('输入内容：')
input7 = '3,5'
# 2.按逗号分割字符串，并且把值转换成整数，然后把值赋予给对应的变量
x, y = map(int, input7.split(','))  # 第一次使用map,后续可以多复习复习 ***
# 3.定义一个新的空列表，以便后续存储结果值
result7 = []
# 4.外层遍历循环
for i in range(0, x):
    # 5.定义新列表，存储二维遍历的元素值
    list7 = []
    # 6.二维元素遍历
    for j in range(0, y):
        # 7.把计算值遍历存入到上层列表中
        list7.append(i * j)
    # 8.把二维元素值放入到外层列表
    result7.append(list7)
# 9.输出结果
print(result7)

print('----------------------- 问题8 -----------------------')

# 问题8
# 编写一个程序，该程序接受以逗号分隔的单词序列作为输入，并在按字母顺序对单词进行排序后以
# 逗号分隔的顺序打印这些单词。
# 假设将以下输入提供给程序：
# without,hello,bag,world
# 然后，输出应为：
# bag,hello,without,world

# input8 = input()
input8 = 'without,hello,bag,world'
list8 = input8.split(',')
list8.sort()
print(list8)

print('----------------------- 问题9 -----------------------')

# 问题9
# 编写一个接受行序列作为输入的程序，并在使句子中的所有字符都大写之后打印行。
# 假设将以下输入提供给程序：
# Hello world
# Practice makes perfect
# 然后，输出应为：
# HELLO WORLD
# PRACTICE MAKES PERFECT

input9 = """
Hello world
Practice makes perfect
"""
result9 = input9.upper()
print(result9)

print('----------------------- 问题10 -----------------------')

# 问题10
# 编写一个程序，该程序接受一系列由空格分隔的单词作为输入，并在删除所有重复的单词并将其按
# 字母数字顺序排序后打印这些单词。
# 假设将以下输入提供给程序：
# hello world and practice makes perfect and hello world again
# 然后，输出应为：
# again and hello makes perfect practice world

#input10 = input()
# input10 = 'hello world and practice makes perfect and hello world again'
# new_list10 = []
# list10 = input10.split()
# set10 = set(list10)
# new_list10 = list(set10)
# new_list10.sort()



print('----------------------- 问题11 -----------------------')

# 问题11
# 编写一个程序，该程序接受以逗号分隔的4位二进制数字序列作为输入，然后检查它们是否可被5
# 整除。被5整除的数字将以逗号分隔的顺序打印。
# 例子：
# 0100,0011,1010,1001
# 然后输出应为：
# 1010

print('----------------------- 问题12 -----------------------')

# 问题12
# 编写一个程序，查找所有介于1000和3000之间的数字（都包括在内），以使数字的每个数字均为
# 偶数。获得的数字应以逗号分隔的顺序打印在一行上。

print('----------------------- 问题13 -----------------------')

# 问题13
# 编写一个接受句子并计算字母和数字数量的程序。
# 假设将以下输入提供给程序：
# hello world! 123
# 然后，输出应为：
# LETTERS 10
# DIGITS 3

print('----------------------- 问题14 -----------------------')

# 问题14
# 编写一个接受句子的程序，并计算大写字母和小写字母的数量。
# 假设将以下输入提供给程序：
# Hello world!
# 然后，输出应为：
# UPPER CASE 1
# LOWER CASE 9

print('----------------------- 问题15 -----------------------')

# 问题15
# 编写一个程序，以给定的数字作为a的值来计算a + aa + aaa + aaaa的值。
# 假设将以下输入提供给程序：
# 9
# 然后，输出应为：
# 11106

print('----------------------- 问题16 -----------------------')

# 问题16
# 使用列表推导对列表中的每个奇数取平方。该列表由逗号分隔的数字序列输入。>假设将以下输入
# 提供给程序：
# 1,2,3,4,5,6,7,8,9
# 然后，输出应为：
# 1,9,25,49,81

print('----------------------- 问题17 -----------------------')

# 问题17
# 编写一个程序，该程序根据来自控制台输入的交易日志来计算银行帐户的净额。事务日志格式如下
# 所示：
# D 100
# W 200
# D表示存款，W表示提款。
# 假设将以下输入提供给程序：
# D 300
# D 300
# W 200
# D 100
# 然后，输出应为：
# 500

print('----------------------- 问题18 -----------------------')

#  问题18
# 网站要求用户输入用户名和密码进行注册。编写程序以检查用户输入的密码是否有效。
# 以下是检查密码的标准：
# [az]之间至少1个字母
# [0-9]之间至少1个数字
# [AZ]之间至少1个字母
# [$＃@]中的至少1个字符
# 交易密码的最小长度：6
# 交易密码的最大长度：12
# 您的程序应接受逗号分隔的密码序列，并将根据上述条件进行检查。符合条件的密码将被打印，每
# 个密码之间用逗号分隔。
# 例子
# 如果输入以下密码作为程序输入：
# ABd1234@1,a F1#,2w3E*,2We3345
# 然后，程序的输出应为：
# ABd1234@1

print('----------------------- 问题19 -----------------------')

# 问题19
# 您需要编写一个程序来按升序对（名称，年龄，分数）元组进行排序，其中名称是字符串，年龄和
# 分数是数字。元组由控制台输入。排序标准是：
# 1：根据名称排序
# 2：然后根据年龄排序
# 3：然后按分数排序
# 优先级是名称>年龄>得分。
# 如果给出以下元组作为程序的输入：
# Tom,19,80
# John,20,90
# Jony,17,91
# Jony,17,93
# Json,21,85
# *然后，程序的输出应为：*
# [('John', '20', '90'), ('Jony', '17', '91'), ('Jony', '17', '93'), ('Json', '21',
# '85'), ('Tom', '19', '80')]

print('----------------------- 问题20 -----------------------')

# 问题20
# 用生成器定义一个类，该生成器可以迭代在给定范围0和n之间可以被7整除的数字。
# 假设将以下输入提供给程序：
# 7
# 然后，输出应为：
# 0
# 7
# 14

print('----------------------- 问题21 -----------------------')
print('----------------------- 问题22 -----------------------')
print('----------------------- 问题23 -----------------------')
print('----------------------- 问题24 -----------------------')
print('----------------------- 问题25 -----------------------')
print('----------------------- 问题26 -----------------------')
print('----------------------- 问题27 -----------------------')
print('----------------------- 问题28 -----------------------')
print('----------------------- 问题29 -----------------------')
print('----------------------- 问题30 -----------------------')
print('----------------------- 问题31 -----------------------')
print('----------------------- 问题32 -----------------------')
print('----------------------- 问题33 -----------------------')
print('----------------------- 问题34 -----------------------')
print('----------------------- 问题35 -----------------------')
print('----------------------- 问题36 -----------------------')
print('----------------------- 问题37 -----------------------')
print('----------------------- 问题38 -----------------------')
print('----------------------- 问题39 -----------------------')
print('----------------------- 问题40 -----------------------')
print('----------------------- 问题41 -----------------------')
print('----------------------- 问题42 -----------------------')
print('----------------------- 问题43 -----------------------')
print('----------------------- 问题44 -----------------------')
print('----------------------- 问题45 -----------------------')
print('----------------------- 问题46 -----------------------')
print('----------------------- 问题47 -----------------------')
print('----------------------- 问题48 -----------------------')
print('----------------------- 问题49 -----------------------')
print('----------------------- 问题50 -----------------------')
print('----------------------- 问题51 -----------------------')
print('----------------------- 问题52 -----------------------')
print('----------------------- 问题53 -----------------------')
print('----------------------- 问题54 -----------------------')
print('----------------------- 问题55 -----------------------')
print('----------------------- 问题56 -----------------------')
print('----------------------- 问题57 -----------------------')
print('----------------------- 问题58 -----------------------')
print('----------------------- 问题59 -----------------------')
print('----------------------- 问题60 -----------------------')
print('----------------------- 问题61 -----------------------')
print('----------------------- 问题62 -----------------------')
print('----------------------- 问题63 -----------------------')
print('----------------------- 问题64 -----------------------')
print('----------------------- 问题65 -----------------------')
print('----------------------- 问题66 -----------------------')
print('----------------------- 问题67 -----------------------')
print('----------------------- 问题68 -----------------------')
print('----------------------- 问题69 -----------------------')
print('----------------------- 问题70 -----------------------')
print('----------------------- 问题71 -----------------------')
print('----------------------- 问题72 -----------------------')
print('----------------------- 问题73 -----------------------')
print('----------------------- 问题74 -----------------------')
print('----------------------- 问题75 -----------------------')
print('----------------------- 问题76 -----------------------')
print('----------------------- 问题77 -----------------------')
print('----------------------- 问题78 -----------------------')
print('----------------------- 问题79 -----------------------')
print('----------------------- 问题80 -----------------------')
print('----------------------- 问题81 -----------------------')
print('----------------------- 问题82 -----------------------')
print('----------------------- 问题83 -----------------------')
print('----------------------- 问题84 -----------------------')
print('----------------------- 问题85 -----------------------')
print('----------------------- 问题86 -----------------------')
print('----------------------- 问题87 -----------------------')
print('----------------------- 问题88 -----------------------')
print('----------------------- 问题89 -----------------------')
print('----------------------- 问题90 -----------------------')
print('----------------------- 问题91 -----------------------')
print('----------------------- 问题92 -----------------------')
print('----------------------- 问题93 -----------------------')
print('----------------------- 问题94 -----------------------')
print('----------------------- 问题95 -----------------------')
print('----------------------- 问题96 -----------------------')
print('----------------------- 问题97 -----------------------')
print('----------------------- 问题98 -----------------------')
print('----------------------- 问题99 -----------------------')
print('----------------------- 问题100 -----------------------')
print('错误集与复刷题目：5, 6, 7, ')
